---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceWallComplexType
source: html/2fcc3896-28ea-38ea-7cd5-becbe575d4db.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceWallComplexType Property

Vertically compound wall type features sweeps, reveals, or split layers are not supported on non-vertical face. Consider using a simplified type.

## Syntax (C#)
```csharp
public static FailureDefinitionId FaceWallComplexType { get; }
```